In [0]:
import pandas as pd
import numpy as np

In [0]:
df1=pd.DataFrame({
    'Date':['2013-11-25','2013-11-24','2013-11-25','2013-11-24'],
    'Fruit':['Banana','Orange','Apple','Celery'],
    'Num':[34,85,77,78],
    'Color':['Yellow','Orange','Green','Green'],
})
df2=pd.DataFrame({
    'Date':['2013-11-24','2013-11-24','2013-11-24','2013-11-24','2013-11-25','2013-11-25'],
    'Fruit':['Banana','Orange','Apple','Celery','Apple','Orange'],
    'Num':[55,85,71,18,34,38],
    'Color':['Yellow','Orange','Green','Green','Red','Orange'],
})

In [4]:
df1.head()

         Date   Fruit  Num   Color
0  2013-11-25  Banana   34  Yellow
1  2013-11-24  Orange   85  Orange
2  2013-11-25   Apple   77   Green
3  2013-11-24  Celery   78   Green

In [5]:
df2.head()

         Date   Fruit  Num   Color
0  2013-11-24  Banana   55  Yellow
1  2013-11-24  Orange   85  Orange
2  2013-11-24   Apple   71   Green
3  2013-11-24  Celery   18   Green
4  2013-11-25   Apple   34     Red

In [6]:
df1.merge(df2,  how='outer', indicator='union')

         Date   Fruit  Num   Color       union
0  2013-11-25  Banana   34  Yellow   left_only
1  2013-11-24  Orange   85  Orange        both
2  2013-11-25   Apple   77   Green   left_only
3  2013-11-24  Celery   78   Green   left_only
4  2013-11-24  Banana   55  Yellow  right_only
5  2013-11-24   Apple   71   Green  right_only
6  2013-11-24  Celery   18   Green  right_only
7  2013-11-25   Apple   34     Red  right_only
8  2013-11-25  Orange   38  Orange  right_only